8.Ladenburg nozzle jet/KNP_mod/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 297;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 247.1;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestreamInlet
    {
        type            fixedValue;
        value           uniform 297;
    }
    freestream
    {
        type            totalTemperature;
        psi             thermo:psi;
        gamma           1.4;
        T0              uniform 297;
        value           uniform 297;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //